import { faker } from '@faker-js/faker';

// ----------------------------------------------------------------------

const POST_TITLES = [
  'โอกาสไม่มี หรือ ไม่เหลือ? ในเมื่อ…',
  'เงินกู้นอกระบบที่ว่าร้าย เงินกู้ในระบบก็ตัวดี',
  'ภาระ หรือ สัมภาระ?',
  'ทำงานเงินเดือนขั้นต่ำ – กราฟิกดีไซน์เงินเดือนขั้นต้น',
  '“มืออาชีพ” ไม่ใช่แค่มีอาชีพ',
  'ส่งท้ายสิ้นปี 2565 – มันดีแล้วที่ผมทำให้คุณผิดหวัง',
  'วัน ๆ หนึ่งทำอะไรบ้าง…',
  '10 บทความดี ๆ ที่ถูกอ่านมากที่สุดปี 2565',
  'รักที่สุดในโลก (ของ…)',
  'Work-life balance ที่ยังมีจริง',
  'เราในเวอร์ชั่นที่ดีที่สุด',
  'อย่าหาเหตุผลที่เขาจากไป…',
  'ต้องลุกให้ไวจึงไปได้ไกลกว่า',
  'หา “กำไร” ให้ตัวเอง (กำไรชีวิต)',
  'วันแม่ในมุมร้าย ๆ',
  'เมื่อชีวิตสู้กลับ',
  'คนเราไม่ชอบให้ใครตัดสิน แต่…',
  'เมื่อ like, share, follow มันกินได้',
  'เปรียบกับน้ำยาปรับผ้านุ่ม',
  'คิดลบ “ให้ถึงที่สุด” (เมื่อคิดบวกมันเสื่อมถอย?)',
  'อย่าอิจฉาใคร เพียงเพราะไม่มีความสุข',
  'เลี้ยงข้าวลูกน้อง (ในมุมมองหนึ่ง)',
  'เพียงแค่รักษาไว้ ก็ทำไม่ได้…',
  'เปลี่ยนแปลงชีวิต เพียงแค่คิดคำถามเดียว',
  'จากใจ Fixed Mindset',
  'รักต่างวัย เป็นไปได้แค่ไหนกัน…',
  'เป็นคนโง่ที่มีระดับ',
  'การพัฒนาตนเองครั้งใหญ่ แค่ “ไม่โกหก”',
  'เมื่อขี้เกียจไม่มีจริง (เพราะมันเป็นเรื่องที่ไม่อยู่ในหัวเรา)',
  'อยากได้ แต่ไม่อยากทำ…',
];

const posts = () =>
  [...Array(23)].map((_, index) => ({
    id: faker.datatype.uuid(),
    cover: `/assets/images/covers/cover_${index + 1}.jpg`,
    title: POST_TITLES[index + 1],
    createdAt: faker.date.past(),
    view: faker.datatype.number(),
    comment: faker.datatype.number(),
    author: {
      name: faker.name.fullName(),
      avatarUrl: `/assets/images/avatars/avatar_${index + 1}.jpg`,
    },
  }));

export default posts;
